NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
static uint32_t flash_manager_entry_invalidate_fail_cb(flash_manager_t * p_manager,
                                                         fm_handle_t handle,
                                                         int calls)
{
    return NRF_ERROR_NO_MEM;
}

fm_entry_t * flash_manager_entry_alloc_cb(flash_manager_t * p_manager,
                                       fm_handle_t       handle,
                                       uint32_t          data_length,
                                       int calls)
{
    TEST_ASSERT_NOT_NULL(p_manager);
    TEST_ASSERT_EQUAL_PTR(mp_flash_manager, p_manager);

    if (m_expected_flash_data.verify_contents)
    {
        TEST_ASSERT_NOT_EQUAL_MESSAGE(0, m_flash_expect_calls, "Flash entry alloc called when not expected");
        m_flash_expect_calls--;
        TEST_ASSERT_EQUAL(m_expected_flash_data.data_length, data_length);
        if (m_expected_flash_data.flash_group == 0)
        {
            TEST_ASSERT_EQUAL_HEX16(m_expected_flash_data.flash_handle, handle);
        }
        else
        {
            TEST_ASSERT_EQUAL_HEX16(m_expected_flash_data.flash_group, handle & DSM_FLASH_HANDLE_FILTER_MASK);
        }
    }

    fm_entry_t * p_data   = malloc(sizeof(fm_header_t) + ALIGN_VAL(data_length, 4));
    TEST_ASSERT_NOT_NULL(p_data);
    p_data->header.len_words = ALIGN_VAL(sizeof(fm_header_t) + data_length, 4);
    p_data->header.handle = handle;
    return p_data;
}

static void flash_manager_entry_commit_cb(const fm_entry_t * p_entry, int call_count)
{
    if (m_expected_flash_data.verify_contents)
    {
        TEST_ASSERT_NOT_NULL(m_expected_flash_data.p_data);
        TEST_ASSERT_NOT_EQUAL(0, m_expected_flash_data.data_length);
        TEST_ASSERT_EQUAL_HEX8_ARRAY(m_expected_flash_data.p_data,
                                    p_entry->data,
                                    m_expected_flash_data.data_length);
    }
    if (m_expected_flash_data.p_data)
    {
        free(m_expected_flash_data.p_data);
    }
    free((fm_entry_t*) p_entry);
    m_expected_flash_data.p_data = NULL;
}


static void flash_expect(void * p_expected_data, uint32_t data_length)
{
    TEST_ASSERT_EQUAL_MESSAGE(NULL, m_expected_flash_data.p_data, "The previous flash operation has not been finished yet.");
    m_expected_flash_data.data_length = data_length;
    m_expected_flash_data.verify_contents = true;
    m_expected_flash_data.p_data = malloc(data_length);
    memcpy(m_expected_flash_data.p_data, p_expected_data, data_length);

    m_flash_expect_calls++;
    flash_manager_entry_alloc_StubWithCallback(flash_manager_entry_alloc_cb);
    flash_manager_entry_commit_StubWithCallback(flash_manager_entry_commit_cb);
}

static void flash_expect_metainfo(void)
{
    dsm_flash_entry_metainfo_t data;
    data.max_addrs_nonvirtual = DSM_NONVIRTUAL_ADDR_MAX;
    data.max_addrs_virtual    = DSM_VIRTUAL_ADDR_MAX;
    data.max_subnets          = DSM_SUBNET_MAX;
    data.max_appkeys          = DSM_APP_MAX;
    data.max_devkeys          = DSM_DEVICE_MAX;
    m_expected_flash_data.flash_group = 0;
    m_expected_flash_data.flash_handle = DSM_FLASH_HANDLE_METAINFO;
    flash_expect(&data, sizeof(data));
}

static void flash_expect_unicast(dsm_local_unicast_address_t * p_addr)
{
    dsm_flash_entry_addr_unicast_t data;
    memset(&data, 0, sizeof(data));

    memcpy(&data.addr, p_addr, sizeof(data.addr));
    m_expected_flash_data.flash_group  = 0;
    m_expected_flash_data.flash_handle = DSM_FLASH_HANDLE_UNICAST;
    flash_expect(&data, sizeof(data));
}

static void flash_expect_addr_nonvirtual(uint16_t addr)
{
    dsm_flash_entry_addr_nonvirtual_t data;
    memset(&data, 0, sizeof(data));

    memcpy(&data.addr, &addr, sizeof(data.addr));
    m_expected_flash_data.flash_group  = DSM_FLASH_GROUP_ADDR_NONVIRTUAL;
    m_expected_flash_data.flash_group = DSM_FLASH_GROUP_ADDR_NONVIRTUAL;
    flash_expect(&data, sizeof(data));
}

static void flash_expect_addr_virtual(const uint8_t * p_uuid)
{
    dsm_flash_entry_addr_virtual_t data;
    memset(&data, 0, sizeof(data));

    memcpy(data.uuid, p_uuid, sizeof(data.uuid));
    m_expected_flash_data.flash_group = DSM_FLASH_GROUP_ADDR_VIRTUAL;
    flash_expect(&data, sizeof(data));
}

static void flash_expect_subnet(const uint8_t * p_key, uint16_t key_index)
{
    dsm_flash_entry_subnet_t data;
    memset(&data, 0, sizeof(data));

    memcpy(data.key, p_key, sizeof(data.key));
    memcpy(&data.key_index, &key_index, sizeof(data.key_index));
    m_expected_flash_data.flash_group = DSM_FLASH_GROUP_SUBNETS;
    flash_expect(&data, sizeof(data));
}

static void flash_expect_subnet_update(const uint8_t * p_old_key, const uint8_t * p_new_key,
        uint16_t key_index, nrf_mesh_key_refresh_phase_t key_refresh_phase, dsm_handle_t handle)
{
    dsm_flash_entry_subnet_t data;
    memset(&data, 0, sizeof(data));


    memcpy(data.key, p_old_key, sizeof(data.key));
    memcpy(data.key_updated, p_new_key, sizeof(data.key_updated));
    memcpy(&data.key_index, &key_index, sizeof(data.key_index));
    data.key_refresh_phase = key_refresh_phase;

    m_expected_flash_data.flash_group = 0;
    m_expected_flash_data.flash_handle = DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_SUBNETS, handle);
    flash_expect(&data, sizeof(data));
}

static void flash_expect_appkey(const uint8_t * p_key, uint16_t key_index, dsm_handle_t subnet_handle)
{
    dsm_flash_entry_appkey_t data;
    memset(&data, 0, sizeof(data));

    memcpy(data.key, p_key, sizeof(data.key));
    memcpy(&data.key_index, &key_index, sizeof(data.key_index));
    memcpy(&data.subnet_handle, &subnet_handle, sizeof(data.subnet_handle));
    m_expected_flash_data.flash_group = DSM_FLASH_GROUP_APPKEYS;
    flash_expect(&data, sizeof(data));
}

static void flash_expect_appkey_update(const uint8_t * p_old_key, const uint8_t * p_new_key,
        uint16_t key_index, dsm_handle_t subnet_handle, dsm_handle_t app_handle)
{
    dsm_flash_entry_appkey_t data;
    memset(&data, 0, sizeof(data));

    memcpy(data.key, p_old_key, sizeof(data.key));
    memcpy(data.key_updated, p_new_key, sizeof(data.key_updated));
    memcpy(&data.key_index, &key_index, sizeof(data.key_index));
    memcpy(&data.subnet_handle, &subnet_handle, sizeof(data.subnet_handle));
    m_expected_flash_data.flash_group = 0;
    m_expected_flash_data.flash_handle = DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_APPKEYS, app_handle);
    flash_expect(&data, sizeof(data));
}

static void flash_expect_devkey(const uint8_t * p_key, uint16_t key_owner, dsm_handle_t subnet_handle)
{
    dsm_flash_entry_devkey_t data;
    memset(&data, 0, sizeof(data));

    memcpy(data.key, p_key, sizeof(data.key));
    memcpy(&data.key_owner, &key_owner, sizeof(data.key_owner));
    memcpy(&data.subnet_handle, &subnet_handle, sizeof(data.subnet_handle));
    m_expected_flash_data.flash_group = DSM_FLASH_GROUP_DEVKEYS;
    flash_expect(&data, sizeof(data));
}

static void flash_invalidate_expect(uint16_t flash_handle)
{
    flash_manager_entry_invalidate_ExpectAndReturn(NULL, flash_handle, NRF_SUCCESS);
    flash_manager_entry_invalidate_IgnoreArg_p_manager();
}

static void flash_get_multiple_expect_start(void)
{
    mp_multiple_expect_prev = NULL;
}

