NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_kr_phase_get(network_handle, &current_phase));
    TEST_ASSERT_EQUAL(NRF_MESH_KEY_REFRESH_PHASE_1, current_phase);

    uint8_t net_key[NRF_MESH_KEY_SIZE];
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_key_get(network_handle, net_key));
    TEST_ASSERT_EQUAL_HEX8_ARRAY(old_key, net_key, NRF_MESH_KEY_SIZE);

    uint8_t new_appkey[NRF_MESH_KEY_SIZE] = { 7, 6, 5, 4, 3, 2, 1, 0, 0, 1, 2, 3, 4, 5, 6, 7};
    uint8_t new_aid = 0xbe;

    /* Update the first application key: */
    nrf_mesh_keygen_aid_ExpectAndReturn(new_appkey, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_aid_IgnoreArg_p_aid();
    nrf_mesh_keygen_aid_ReturnMemThruPtr_p_aid(&new_aid, sizeof(new_aid));
    flash_expect_appkey_update(app[0].key, new_appkey, 0, network_handle, app[0].handle);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_appkey_update(app[0].handle, new_appkey));

    /* Update the second application key: */
    nrf_mesh_keygen_aid_ExpectAndReturn(new_appkey, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_aid_IgnoreArg_p_aid();
    nrf_mesh_keygen_aid_ReturnMemThruPtr_p_aid(&new_aid, sizeof(new_aid));
    flash_expect_appkey_update(app[1].key, new_appkey, 1, network_handle, app[1].handle);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_appkey_update(app[1].handle, new_appkey));

    /* Since we are in key refresh phase 1, the old keys should still be used for transmitting packets: */
    for (uint32_t i = 0; i < ARRAY_SIZE(app); i++)
    {
        nrf_mesh_secmat_t secmat;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_tx_secmat_get(DSM_HANDLE_INVALID, app[i].handle, &secmat));

        /* Verify application secmat: */
        TEST_ASSERT_EQUAL_HEX8_ARRAY(app[i].key, secmat.p_app->key, NRF_MESH_KEY_SIZE);
        TEST_ASSERT_EQUAL_HEX8(app[i].aid, secmat.p_app->aid);

        /* Verify network secmat: */
        TEST_ASSERT_EQUAL_HEX8_ARRAY(old_secmat.encryption_key, secmat.p_net->encryption_key, NRF_MESH_KEY_SIZE);
        TEST_ASSERT_EQUAL_HEX8_ARRAY(old_secmat.privacy_key, secmat.p_net->privacy_key, NRF_MESH_KEY_SIZE);
        TEST_ASSERT_EQUAL_HEX8(old_secmat.nid, secmat.p_net->nid);
    }

    /* Both the old and the new security materials should be used when receiving packets: */
    uint8_t expected_key[NRF_MESH_KEY_SIZE];
    const nrf_mesh_network_secmat_t * p_primary = NULL, * p_secondary = NULL;

    /* Check if the old NID can still be used: */
    nrf_mesh_net_secmat_next_get(old_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NOT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);

    memset(expected_key, 1, NRF_MESH_KEY_SIZE);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_key, p_primary->privacy_key, NRF_MESH_KEY_SIZE);
    memset(expected_key, 2, NRF_MESH_KEY_SIZE);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_key, p_primary->encryption_key, NRF_MESH_KEY_SIZE);

    nrf_mesh_net_secmat_next_get(old_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);

    /* Check that the new NID can also be used: */
    p_primary = NULL;
    p_secondary = NULL;
    nrf_mesh_net_secmat_next_get(new_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NOT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);

    memset(expected_key, 11, NRF_MESH_KEY_SIZE);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_key, p_primary->privacy_key, NRF_MESH_KEY_SIZE);
    memset(expected_key, 22, NRF_MESH_KEY_SIZE);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_key, p_primary->encryption_key, NRF_MESH_KEY_SIZE);

    nrf_mesh_net_secmat_next_get(new_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);

    /* Enter key refresh phase 2, by swapping the keys used for transmission of packets: */
    flash_expect_subnet_update(old_key, new_key, key_index, NRF_MESH_KEY_REFRESH_PHASE_2, network_handle);
    net_state_key_refresh_phase_changed_Expect(key_index, new_beacon_secmat.net_id, NRF_MESH_KEY_REFRESH_PHASE_2);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_update_swap_keys(network_handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, dsm_subnet_update_swap_keys(network_handle));

    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_kr_phase_get(network_handle, &current_phase));
    TEST_ASSERT_EQUAL(NRF_MESH_KEY_REFRESH_PHASE_2, current_phase);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_key_get(network_handle, net_key));
    TEST_ASSERT_EQUAL_HEX8_ARRAY(new_key, net_key, NRF_MESH_KEY_SIZE);

    /* In key refresh phase 2, the new keys should be used for transmitting packets: */
    for (uint32_t i = 0; i < ARRAY_SIZE(app); i++)
    {
        nrf_mesh_secmat_t secmat;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_tx_secmat_get(DSM_HANDLE_INVALID, app[i].handle, &secmat));

        /* Verify application secmat: */
        if (i == 0 || i == 1) /* The first two application keys were set to 0 above */
        {
            TEST_ASSERT_EQUAL_HEX8(new_aid, secmat.p_app->aid);
            TEST_ASSERT_EQUAL_HEX8_ARRAY(new_appkey, secmat.p_app->key, NRF_MESH_KEY_SIZE);
        }
        else /* The other application keys have not been updated and should be the same as before */
        {
            TEST_ASSERT_EQUAL_HEX8(app[i].aid, secmat.p_app->aid);
            TEST_ASSERT_EQUAL_HEX8_ARRAY(app[i].key, secmat.p_app->key, NRF_MESH_KEY_SIZE);
        }

        /* Verify network secmat: */
        TEST_ASSERT_EQUAL_HEX8_ARRAY(new_secmat.encryption_key, secmat.p_net->encryption_key, NRF_MESH_KEY_SIZE);
        TEST_ASSERT_EQUAL_HEX8_ARRAY(new_secmat.privacy_key, secmat.p_net->privacy_key, NRF_MESH_KEY_SIZE);
        TEST_ASSERT_EQUAL_HEX8(new_secmat.nid, secmat.p_net->nid);

        /* Ensure that application keys cannot be updated in key refresh phase 2: */
        TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, dsm_appkey_update(app[i].aid, new_appkey));
    }

    /* Both old and new security materials are still used when receiving packets: */
    p_primary = NULL;
    p_secondary = NULL;

    /* Check that the old NID can still be used to receive packets: */
    nrf_mesh_net_secmat_next_get(old_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NOT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);

