NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
    memset(expected_key, 1, NRF_MESH_KEY_SIZE);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_key, p_primary->privacy_key, NRF_MESH_KEY_SIZE);
    memset(expected_key, 2, NRF_MESH_KEY_SIZE);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_key, p_primary->encryption_key, NRF_MESH_KEY_SIZE);

    nrf_mesh_net_secmat_next_get(old_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);

    /* Check that the new NID can still be used to receive packets: */
    nrf_mesh_net_secmat_next_get(new_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NOT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);

    memset(expected_key, 11, NRF_MESH_KEY_SIZE);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_key, p_primary->privacy_key, NRF_MESH_KEY_SIZE);
    memset(expected_key, 22, NRF_MESH_KEY_SIZE);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_key, p_primary->encryption_key, NRF_MESH_KEY_SIZE);

    nrf_mesh_net_secmat_next_get(new_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);

    TEST_IGNORE_MESSAGE("Testing going to KR phase 3 requires mocking support for multiple flash writes, see MBTLE-2059");
#if 0
    /* Move to key refresh phase 3 (which is immediately goes back to phase 0): */
    net_state_key_refresh_phase_changed_Expect(key_index, NRF_MESH_KEY_REFRESH_PHASE_0);
    flash_expect_subnet(new_key, key_index);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_update_commit(network_handle));

    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_kr_phase_get(network_handle, &current_phase));
    TEST_ASSERT_EQUAL(NRF_MESH_KEY_REFRESH_PHASE_0, current_phase);

    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, dsm_subnet_update_commit(network_handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, dsm_subnet_update_swap_keys(network_handle));

    /* In key refresh phase 3, only new keys should be used for transmitting packets: */
    for (uint32_t i = 0; i < ARRAY_SIZE(app); i++)
    {
        nrf_mesh_secmat_t secmat;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_tx_secmat_get(DSM_HANDLE_INVALID, app[i].handle, &secmat));

        /* Verify application secmat: */
        if (i == 0 || i == 1)
        {
            TEST_ASSERT_EQUAL_HEX8(new_aid, secmat.p_app->aid);
            TEST_ASSERT_EQUAL_HEX8_ARRAY(new_appkey, secmat.p_app->key, NRF_MESH_KEY_SIZE);
        }
        else
        {
            TEST_ASSERT_EQUAL_HEX8(app[i].aid, secmat.p_app->aid);
            TEST_ASSERT_EQUAL_HEX8_ARRAY(app[i].key, secmat.p_app->key, NRF_MESH_KEY_SIZE);
        }

        /* Verify network secmat: */
        TEST_ASSERT_EQUAL_HEX8_ARRAY(new_secmat.encryption_key, secmat.p_net->encryption_key, NRF_MESH_KEY_SIZE);
        TEST_ASSERT_EQUAL_HEX8_ARRAY(new_secmat.privacy_key, secmat.p_net->privacy_key, NRF_MESH_KEY_SIZE);
        TEST_ASSERT_EQUAL_HEX8(new_secmat.nid, secmat.p_net->nid);
    }

    /* Check that the new NID can be used to receive packets: */
    nrf_mesh_net_secmat_next_get(new_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NOT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);

    memset(expected_key, 11, NRF_MESH_KEY_SIZE);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_key, p_primary->privacy_key, NRF_MESH_KEY_SIZE);
    memset(expected_key, 22, NRF_MESH_KEY_SIZE);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_key, p_primary->encryption_key, NRF_MESH_KEY_SIZE);

    nrf_mesh_net_secmat_next_get(new_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);

    nrf_mesh_net_secmat_next_get(old_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);
#endif
}

void test_key_refresh_1_to_3(void)
{
    dsm_handle_t network_handle;
    nrf_mesh_network_secmat_t old_secmat, new_secmat;
    nrf_mesh_beacon_secmat_t old_beacon_secmat, new_beacon_secmat;

    const unsigned int old_nid = 2, new_nid = 18, key_index = 0;
    const uint8_t old_key[NRF_MESH_KEY_SIZE] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16 };
    const uint8_t new_key[NRF_MESH_KEY_SIZE] = { 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1 };

    /* Test API functions on non-existent keys: */
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_subnet_update(0, new_key));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_subnet_update_swap_keys(0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_subnet_update_commit(0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_appkey_update(0, new_key));

    /* Add the original network key, which will be refreshed: */
    memset(old_secmat.privacy_key,    1, NRF_MESH_KEY_SIZE);
    memset(old_secmat.encryption_key, 2, NRF_MESH_KEY_SIZE);
    memset(old_beacon_secmat.key,     3, NRF_MESH_KEY_SIZE);
    memset(old_beacon_secmat.net_id,  4, NRF_MESH_NETID_SIZE);
    memset(new_beacon_secmat.key,    33, NRF_MESH_KEY_SIZE);
    memset(new_beacon_secmat.net_id, 44, NRF_MESH_NETID_SIZE);
    old_secmat.nid = old_nid;
    nrf_mesh_keygen_network_secmat_ExpectAndReturn(old_key, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_network_secmat_ReturnMemThruPtr_p_secmat(&old_secmat, sizeof(old_secmat));
    nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(old_key, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_beacon_secmat_ReturnMemThruPtr_p_secmat(&old_beacon_secmat, sizeof(old_beacon_secmat));
    flash_expect_subnet(old_key, key_index);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_add(key_index, old_key, &network_handle));

    nrf_mesh_key_refresh_phase_t current_phase;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_kr_phase_get(network_handle, &current_phase));
    TEST_ASSERT_EQUAL(NRF_MESH_KEY_REFRESH_PHASE_0, current_phase);

    /* Start the key update procedure (go to KR phase 1): */
    memset(new_secmat.privacy_key,    11, NRF_MESH_KEY_SIZE);
    memset(new_secmat.encryption_key, 22, NRF_MESH_KEY_SIZE);
    new_secmat.nid = new_nid;
    nrf_mesh_keygen_network_secmat_ExpectAndReturn(new_key, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_network_secmat_ReturnMemThruPtr_p_secmat(&new_secmat, sizeof(new_secmat));
    net_state_key_refresh_phase_changed_Expect(key_index, new_beacon_secmat.net_id, NRF_MESH_KEY_REFRESH_PHASE_1);
    nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(new_key, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_beacon_secmat_ReturnMemThruPtr_p_secmat(&new_beacon_secmat, sizeof(new_beacon_secmat));
    flash_expect_subnet_update(old_key, new_key, key_index, NRF_MESH_KEY_REFRESH_PHASE_1, network_handle);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_update(network_handle, new_key));

