NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_kr_phase_get(network_handle, &current_phase));
    TEST_ASSERT_EQUAL(NRF_MESH_KEY_REFRESH_PHASE_1, current_phase);

    /* Skip phase 2 and go directly to phase 3 (which goes immediately to phase 0 again): */
    net_state_key_refresh_phase_changed_Expect(key_index, new_beacon_secmat.net_id, NRF_MESH_KEY_REFRESH_PHASE_0);
    flash_expect_subnet(new_key, key_index);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_update_commit(network_handle));

    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_kr_phase_get(network_handle, &current_phase));
    TEST_ASSERT_EQUAL(NRF_MESH_KEY_REFRESH_PHASE_0, current_phase);
}

/** Helper macro for flash load testing */
#define FLASH_ENTRY_GET_EXPECT(HANDLE, RETVAL)                                          \
    do                                                                                  \
    {                                                                                   \
        flash_manager_entry_get_ExpectAndReturn(NULL, HANDLE, (fm_entry_t *) (RETVAL)); \
        flash_manager_entry_get_IgnoreArg_p_manager();                                  \
    } while (0)


void test_flash_load(void)
{
    flash_manager_add_StubWithCallback(NULL); /* want custom checking on this */
    FLASH_ENTRY_GET_EXPECT(DSM_FLASH_HANDLE_METAINFO, NULL);
    TEST_ASSERT_FALSE(dsm_flash_config_load());

    /* Gradually add more entries until we get an acceptable flash config */

    dsm_entry_t metainfo;

    metainfo.entry.metainfo.max_subnets = DSM_SUBNET_MAX - 1; /* invalid! */
    metainfo.entry.metainfo.max_appkeys = DSM_APP_MAX;
    metainfo.entry.metainfo.max_devkeys = DSM_DEVICE_MAX;
    metainfo.entry.metainfo.max_addrs_virtual = DSM_VIRTUAL_ADDR_MAX;
    metainfo.entry.metainfo.max_addrs_nonvirtual = DSM_NONVIRTUAL_ADDR_MAX;

    /* Fail resetting the flash manager */
    FLASH_ENTRY_GET_EXPECT(DSM_FLASH_HANDLE_METAINFO, &metainfo);
    flash_manager_remove_IgnoreAndReturn(NRF_ERROR_NO_MEM);
    flash_manager_mem_listener_register_StubWithCallback(flash_manager_mem_listener_register_cb);
    m_fm_mem_listener_register_expect = 1;
    TEST_ASSERT_FALSE(dsm_flash_config_load());
    TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);
    TEST_ASSERT_NOT_NULL(mp_mem_listener);
    /* recover from the failure to reset */
    flash_manager_remove_ExpectAndReturn(mp_flash_manager, NRF_SUCCESS);
    mp_mem_listener->callback(mp_mem_listener->p_args); /* should call remove */
    flash_manager_mock_Verify();
    /* fail adding */
    net_state_flash_area_get_ExpectAndReturn((void *)(PAGE_SIZE + (uint32_t)m_flash_area));
    flash_manager_add_ExpectAndReturn(mp_flash_manager,
                                      &mp_flash_manager->config,
                                      NRF_ERROR_NO_MEM);
    m_fm_mem_listener_register_expect = 1;
    mp_flash_manager->config.remove_complete_cb(mp_flash_manager);
    TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);

    /* notify about more memory, and succeed all calls this time. */
    net_state_flash_area_get_ExpectAndReturn((void *)(PAGE_SIZE + (uint32_t)m_flash_area));
    flash_manager_add_ExpectAndReturn(mp_flash_manager,
                                      &mp_flash_manager->config,
                                      NRF_SUCCESS);
    mp_flash_manager->internal.state = FM_STATE_BUILDING;
    flash_expect_metainfo();
    mp_mem_listener->callback(mp_mem_listener->p_args);


    /* Run again, but this time, succeed resetting. */
    FLASH_ENTRY_GET_EXPECT(DSM_FLASH_HANDLE_METAINFO, &metainfo);
    flash_manager_remove_IgnoreAndReturn(NRF_SUCCESS);
    TEST_ASSERT_FALSE(dsm_flash_config_load());
    flash_manager_mock_Verify();

    net_state_flash_area_get_ExpectAndReturn((void *)(PAGE_SIZE + (uint32_t)m_flash_area));
    flash_manager_add_ExpectAndReturn(mp_flash_manager,
                                      &mp_flash_manager->config,
                                      NRF_SUCCESS);
    flash_expect_metainfo();
    mp_flash_manager->config.remove_complete_cb(mp_flash_manager);

    metainfo.entry.metainfo.max_subnets = DSM_SUBNET_MAX; /* valid */

    FLASH_ENTRY_GET_EXPECT(DSM_FLASH_HANDLE_METAINFO, &metainfo);
    flash_get_multiple_expect_start();
    flash_get_multiple_expect_end(); /* No other entries found */
    TEST_ASSERT_FALSE(dsm_flash_config_load()); /* Still false, as we couldn't find a unicast address */

    /* Set up a bunch of each type of stored entry, verify that we do the required encryption for each. */
#define ENTRY_COUNT 4

    /* Adding a unicast address will make the loader return true, as the device has been provisioned. */
    dsm_entry_t unicast;
    unicast.header.handle = DSM_FLASH_HANDLE_UNICAST;
    unicast.header.len_words = 2;
    unicast.entry.addr_unicast.addr.address_start = 0x0001;
    unicast.entry.addr_unicast.addr.count         = 0x0001;

    dsm_entry_t addr_nonvirtual[ENTRY_COUNT];
    for (uint32_t i = 0; i < ENTRY_COUNT; ++i)
    {
        fm_header_t header = {.handle =
                                  DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_ADDR_NONVIRTUAL, i),
                              .len_words = (sizeof(dsm_flash_entry_addr_nonvirtual_t) + 3) / 4 + 1};
        memcpy(&addr_nonvirtual[i].header, &header, sizeof(header));
        addr_nonvirtual[i].entry.addr_nonvirtual.addr = i;
    };

    dsm_entry_t addr_virtual[ENTRY_COUNT];
    for (uint32_t i = 0; i < ENTRY_COUNT; ++i)
    {
        fm_header_t header = {.handle = DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_ADDR_VIRTUAL, i),
                              .len_words = (sizeof(dsm_flash_entry_addr_virtual_t) + 3) / 4 + 1};
        memcpy(&addr_virtual[i].header, &header, sizeof(header));
        memset(addr_virtual[i].entry.addr_virtual.uuid, i, NRF_MESH_UUID_SIZE);

        nrf_mesh_keygen_virtual_address_ExpectAndReturn(addr_virtual[i].entry.addr_virtual.uuid,
                                                        NULL,
                                                        NRF_SUCCESS);
        nrf_mesh_keygen_virtual_address_IgnoreArg_p_address();
    };

    dsm_entry_t subnets[ENTRY_COUNT];
    for (uint32_t i = 0; i < ENTRY_COUNT; ++i)
    {
        fm_header_t header = {.handle = DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_SUBNETS, i),
                              .len_words    = (sizeof(dsm_flash_entry_subnet_t) + 3) / 4 + 1};

