NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
        /* The first half of the ENTRY_COUNT subnets contain an updated network key: */
        if (i < ENTRY_COUNT / 2)
        {
            subnets[i].entry.subnet.key_refresh_phase = NRF_MESH_KEY_REFRESH_PHASE_1;
            memset(subnets[i].entry.subnet.key_updated, i * 10, NRF_MESH_KEY_SIZE);
        }
        else
        {
            subnets[i].entry.subnet.key_refresh_phase = NRF_MESH_KEY_REFRESH_PHASE_0;
            header.len_words -= sizeof(subnets[i].entry.subnet.key_updated) / 4;
        }

        memcpy(&subnets[i].header, &header, sizeof(header));
        memset(subnets[i].entry.subnet.key, i, NRF_MESH_KEY_SIZE);
        subnets[i].entry.subnet.key_index = i + 0x100;

        nrf_mesh_keygen_network_secmat_ExpectAndReturn(subnets[i].entry.subnet.key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();

        if (i < ENTRY_COUNT / 2)
        {
            nrf_mesh_keygen_network_secmat_ExpectAndReturn(subnets[i].entry.subnet.key_updated, NULL, NRF_SUCCESS);
            nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
        }

        nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(subnets[i].entry.subnet.key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();

#if GATT_PROXY
        nrf_mesh_keygen_identitykey_ExpectAndReturn(subnets[i].entry.subnet.key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_identitykey_IgnoreArg_p_key();
#endif
    };

    dsm_entry_t appkeys[ENTRY_COUNT];
    for (uint32_t i = 0; i < ENTRY_COUNT; ++i)
    {
        fm_header_t header = {.handle = DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_APPKEYS, i),
                              .len_words    = (sizeof(dsm_flash_entry_appkey_t) + 3) / 4 + 1};

        /* The first half of the ENTRY_COUNT appkeys contains updated keys, the second half does not: */
        if (i >= ENTRY_COUNT / 2)
        {
            header.len_words -= sizeof(appkeys[i].entry.appkey.key_updated) / 4;
        }

        memcpy(&appkeys[i].header, &header, sizeof(header));
        memset(appkeys[i].entry.appkey.key, i, NRF_MESH_KEY_SIZE);
        appkeys[i].entry.appkey.key_index = i + 0x200;
        appkeys[i].entry.appkey.subnet_handle = i;

        nrf_mesh_keygen_aid_ExpectAndReturn(appkeys[i].entry.appkey.key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_aid_IgnoreArg_p_aid();

        if (i < ENTRY_COUNT / 2)
        {
            nrf_mesh_keygen_aid_ExpectAndReturn(appkeys[i].entry.appkey.key_updated, NULL, NRF_SUCCESS);
            nrf_mesh_keygen_aid_IgnoreArg_p_aid();
        }
    };

    dsm_entry_t devkeys[ENTRY_COUNT];
    for (uint32_t i = 0; i < ENTRY_COUNT; ++i)
    {
        fm_header_t header = {.handle = DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_DEVKEYS, i),
                              .len_words    = (sizeof(dsm_flash_entry_devkey_t) + 3) / 4 + 1};
        memcpy(&devkeys[i].header, &header, sizeof(header));
        memset(devkeys[i].entry.devkey.key, i, NRF_MESH_KEY_SIZE);
        devkeys[i].entry.devkey.key_owner     = i + 0x100;
        devkeys[i].entry.devkey.subnet_handle = i;
    };


    /* Load them all */
    FLASH_ENTRY_GET_EXPECT(DSM_FLASH_HANDLE_METAINFO, &metainfo);
    flash_get_multiple_expect_start();
    flash_get_multiple_expect(&unicast, 1);
    flash_get_multiple_expect(addr_nonvirtual, ENTRY_COUNT);
    flash_get_multiple_expect(addr_virtual, ENTRY_COUNT);
    flash_get_multiple_expect(subnets, ENTRY_COUNT);
    flash_get_multiple_expect(appkeys, ENTRY_COUNT);
    flash_get_multiple_expect(devkeys, ENTRY_COUNT);
    flash_get_multiple_expect_end();
    TEST_ASSERT_TRUE(dsm_flash_config_load());

    /* Check that they're all present */
    for (uint32_t i = 0; i < ENTRY_COUNT; ++i)
    {
        nrf_mesh_secmat_t secmat;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_tx_secmat_get(DSM_HANDLE_INVALID, i + DSM_APP_MAX, &secmat));
        TEST_ASSERT_EQUAL(true, secmat.p_app->is_device_key);
        TEST_ASSERT_EQUAL_HEX8_ARRAY(devkeys[i].entry.devkey.key,
                                     secmat.p_app->key,
                                     NRF_MESH_KEY_SIZE);
    }
    for (uint32_t i = 0; i < ENTRY_COUNT; ++i)
    {
        mesh_key_index_t key_index;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_handle_to_netkey_index(i, &key_index));
        TEST_ASSERT_EQUAL(i + 0x100, key_index);
    }
    for (uint32_t i = 0; i < ENTRY_COUNT; ++i)
    {
        mesh_key_index_t key_index;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_appkey_handle_to_appkey_index(i, &key_index));
        TEST_ASSERT_EQUAL(i + 0x200, key_index);
    }
}
#undef FLASH_ENTRY_GET_EXPECT

void test_flash_insufficient_resources(void)
{
    /* setup the flash functions to fail, so we have to retry flashing later */
    flash_manager_entry_alloc_StubWithCallback(flash_manager_entry_alloc_fail_cb);
    flash_manager_entry_invalidate_StubWithCallback(flash_manager_entry_invalidate_fail_cb);

    flash_manager_mem_listener_register_StubWithCallback(flash_manager_mem_listener_register_cb);

    /* Add some dummy networks */
    struct
    {
        dsm_handle_t handle;
        nrf_mesh_network_secmat_t secmat;
        nrf_mesh_beacon_secmat_t beacon_secmat;
    } net[3];
    uint8_t key[NRF_MESH_KEY_SIZE] = {};
    for (uint32_t i = 0; i < ARRAY_SIZE(net); i++)
    {
        memset(net[i].secmat.privacy_key, i, NRF_MESH_KEY_SIZE);
        memset(net[i].secmat.encryption_key, i + 0x10, NRF_MESH_KEY_SIZE);
        memset(net[i].beacon_secmat.key, i + 0x20, NRF_MESH_KEY_SIZE);
        memset(net[i].beacon_secmat.net_id, i + 0x30, NRF_MESH_NETID_SIZE);
        net[i].secmat.nid = i;
        nrf_mesh_keygen_network_secmat_ExpectAndReturn(key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_network_secmat_ReturnMemThruPtr_p_secmat(&net[i].secmat, sizeof(net[i].secmat));
        nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_beacon_secmat_ReturnMemThruPtr_p_secmat(&net[i].beacon_secmat, sizeof(net[i].beacon_secmat));

