NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
        m_fm_mem_listener_register_expect = 1;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_add(i, key, &net[i].handle));
        TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);

        uint16_t index = 0xffff;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_handle_to_netkey_index(net[i].handle, &index));
        TEST_ASSERT_EQUAL(i, index);
    }
    /* Add some dummy apps */
    struct
    {
        dsm_handle_t handle;
        uint8_t aid;
    } app[6];
    for (uint32_t i = 0; i < ARRAY_SIZE(app); i++)
    {
        nrf_mesh_keygen_aid_ExpectAndReturn(key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_aid_IgnoreArg_p_aid();
        nrf_mesh_keygen_aid_ReturnMemThruPtr_p_aid(&app[i].aid, sizeof(app[i].aid));
        m_fm_mem_listener_register_expect = 1;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_appkey_add(i, net[i / 2].handle, key, &app[i].handle));
        TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);
    }
    /* Add some dummy devkeys */
    struct
    {
        dsm_handle_t handle;
    } dev[4];
    for (uint32_t i = 0; i < ARRAY_SIZE(dev); i++)
    {
        m_fm_mem_listener_register_expect = 1;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_devkey_add(i + 0x1000, net[i / 2].handle, key, &dev[i].handle));
        TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);
    }

    /* Add some dummy nonvirtual addresses */
    struct
    {
        dsm_handle_t handle;
    } addr_nonvirtual[4];
    for (uint32_t i = 0; i < ARRAY_SIZE(addr_nonvirtual); i++)
    {
        m_fm_mem_listener_register_expect = 1;
        TEST_ASSERT_EQUAL(NRF_SUCCESS,
                          dsm_address_publish_add(i + 0xF000, &addr_nonvirtual[i].handle));
        TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);
    }
    /* Add some dummy virtual addresses */
    struct
    {
        dsm_handle_t handle;
        uint8_t uuid[NRF_MESH_UUID_SIZE];
    } addr_virtual[4];
    for (uint32_t i = 0; i < ARRAY_SIZE(addr_virtual); i++)
    {
        nrf_mesh_keygen_virtual_address_ExpectAndReturn(addr_virtual[i].uuid,
                                                        NULL,
                                                        NRF_SUCCESS); /*lint !e603 addr_virtual[i].uuid is intentionally not initialized*/
        nrf_mesh_keygen_virtual_address_IgnoreArg_p_address();
        m_fm_mem_listener_register_expect = 1;
        TEST_ASSERT_EQUAL(NRF_SUCCESS,
                          dsm_address_publish_virtual_add(addr_virtual[i].uuid,
                                                          &addr_virtual[i].handle));
        TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);
    }

    /*** We now have some entries of each type that hasn't been flashed yet. ***/
    TEST_ASSERT_TRUE(dsm_has_unflashed_data());

    /* Now start flashing the entries. */

    /* Switch to the flash stubs that actually do something */
    m_expected_flash_data.verify_contents = false;
    flash_manager_entry_alloc_StubWithCallback(flash_manager_entry_alloc_cb);
    flash_manager_entry_commit_StubWithCallback(flash_manager_entry_commit_cb);

    mp_mem_listener->callback(mp_mem_listener->p_args);
    TEST_ASSERT_FALSE(dsm_has_unflashed_data());


    /******* Delete some entries *******/
    m_fm_mem_listener_register_expect = 1;
    /* setup the flash functions to fail, so we have to retry flashing later */
    flash_manager_entry_alloc_StubWithCallback(flash_manager_entry_alloc_fail_cb);
    flash_manager_entry_invalidate_StubWithCallback(NULL);

    /* Delete the first of each entry type. Only the first call will attempt (and fail) flashing. */
    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_DEVKEYS, dev[0].handle - DSM_APP_MAX),
        NRF_ERROR_NO_MEM);
    m_fm_mem_listener_register_expect = 1;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_devkey_delete(dev[0].handle));
    TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);
    /* call the others, all of which will avoid calling flash, as the module is waiting for memory */

    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_APPKEYS, app[0].handle),
        NRF_ERROR_NO_MEM);
    m_fm_mem_listener_register_expect = 1;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_appkey_delete(app[0].handle));
    TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);

    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_APPKEYS, app[1].handle),
        NRF_ERROR_NO_MEM);
    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_SUBNETS, net[0].handle),
        NRF_ERROR_NO_MEM);
    m_fm_mem_listener_register_expect = 2;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_delete(net[0].handle)); /* This'll also delete app[1] not dev[1], as it's bound to application key */
    TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);

    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_ADDR_NONVIRTUAL, addr_nonvirtual[0].handle),
        NRF_ERROR_NO_MEM);
    m_fm_mem_listener_register_expect = 1;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_publish_remove(addr_nonvirtual[0].handle));
    TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);

    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_ADDR_VIRTUAL, addr_virtual[0].handle - DSM_NONVIRTUAL_ADDR_MAX),
        NRF_ERROR_NO_MEM);
    m_fm_mem_listener_register_expect = 1;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_publish_remove(addr_virtual[0].handle));
    TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);

    TEST_ASSERT_TRUE(dsm_has_unflashed_data());
    flash_manager_mock_Verify();

    /* Run async flashing, to attempt recovering. Fail about half of them. Need to do it in entry type order */
    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_ADDR_NONVIRTUAL, addr_nonvirtual[0].handle),
        NRF_SUCCESS);

    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_ADDR_VIRTUAL, addr_virtual[0].handle - DSM_NONVIRTUAL_ADDR_MAX),
        NRF_SUCCESS);

    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_SUBNETS, net[0].handle),
        NRF_SUCCESS);

    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_APPKEYS, app[0].handle),
        NRF_SUCCESS);

    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_APPKEYS, app[1].handle),
        NRF_ERROR_NO_MEM);
    /*
    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_DEVKEYS, dev[0].handle - DSM_APP_MAX),
        NRF_ERROR_NO_MEM);
    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_DEVKEYS, dev[1].handle - DSM_APP_MAX),
        NRF_ERROR_NO_MEM);
    */

    /* Now do the flashing, and reorder the callback, as some operations failed: */
    m_fm_mem_listener_register_expect = 1;
    mp_mem_listener->callback(mp_mem_listener->p_args);
    flash_manager_mock_Verify();
    TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);

    TEST_ASSERT_TRUE(dsm_has_unflashed_data());

    /* expect the entries we couldn't finish, and return success this time. */

    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_APPKEYS, app[1].handle),
        NRF_SUCCESS);

    flash_manager_entry_invalidate_ExpectAndReturn(
        mp_flash_manager,
        DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_DEVKEYS, dev[0].handle - DSM_APP_MAX),
        NRF_SUCCESS);
    /* Flash the last one, the listener shouldn't register this time. */
    mp_mem_listener->callback(mp_mem_listener->p_args);
    TEST_ASSERT_FALSE(dsm_has_unflashed_data());
}


void test_storage_ordering_addresses(void)
{
    const uint16_t raw_addresses[4] = {0x1234, 0x1237, 0x1643, 0x043f};
    dsm_handle_t handles[8] = {DSM_HANDLE_INVALID};

    for (uint32_t i = 0; i < 4; ++i)
    {
        flash_expect_addr_nonvirtual(raw_addresses[i]);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_publish_add(raw_addresses[i], &handles[i]));
    }

    dsm_handle_t stored_handles[8] = {DSM_HANDLE_INVALID};
    uint32_t count = 8;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_get_all(stored_handles, &count));
    TEST_ASSERT_EQUAL_UINT16_ARRAY(handles, stored_handles, count);

    const struct
    {
        uint16_t value;
        uint8_t uuid[NRF_MESH_UUID_SIZE];
    } virtual_addr[4] = {
        {.value = 0x8034, {1}},
        {.value = 0x8037, {2}},
        {.value = 0x8043, {3}},
        {.value = 0x803f, {4}}
    };

    for (uint32_t i = 0; i < 4; ++i)
    {
        nrf_mesh_keygen_virtual_address_ExpectAndReturn(virtual_addr[i].uuid, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_virtual_address_IgnoreArg_p_address();
        flash_expect_addr_virtual(virtual_addr[i].uuid);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_publish_virtual_add(virtual_addr[i].uuid, &handles[i+count]));
    }

