NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
    memset(stored_handles, 0xFF, sizeof(stored_handles));
    count = 8;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_get_all(stored_handles, &count));
    TEST_ASSERT_EQUAL(8, count);
    TEST_ASSERT_EQUAL_UINT16_ARRAY(handles, stored_handles, count);

#if TEST_EXPLICIT_ORDERING
    /* We use our superpowers to know that the virtual addresses start after the end of the non-virtuals. */
    const dsm_handle_t expected_handles[8] = {0, 1, 2, 3,
                                              DSM_NONVIRTUAL_ADDR_MAX, /* Virtual addresses. */
                                              DSM_NONVIRTUAL_ADDR_MAX + 1,
                                              DSM_NONVIRTUAL_ADDR_MAX + 2,
                                              DSM_NONVIRTUAL_ADDR_MAX + 3};
    TEST_ASSERT_EQUAL_UINT16_ARRAY(expected_handles, stored_handles, count);
#endif
}

void test_storage_ordering_subnets(void)
{
    const struct
    {
        mesh_key_index_t key_id;
        uint8_t key[NRF_MESH_KEY_SIZE];
    } subnets[4] = {
        {.key_id = 0, .key = {0}},
        {.key_id = 1, .key = {1}},
        {.key_id = 2, .key = {2}},
        {.key_id = 3, .key = {3}}
    };
    dsm_handle_t handles[4] = {DSM_HANDLE_INVALID};
    for (uint32_t i = 0; i < 4; ++i)
    {
        nrf_mesh_keygen_network_secmat_ExpectAndReturn(subnets[i].key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(subnets[i].key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();
        flash_expect_subnet(subnets[i].key, subnets[i].key_id);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_add(subnets[i].key_id, subnets[i].key, &handles[i]));
    }
    dsm_handle_t stored_handles[4] = {DSM_HANDLE_INVALID};
    uint32_t count = 4;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_get_all(stored_handles, &count));
    TEST_ASSERT_EQUAL(4, count);
    TEST_ASSERT_EQUAL_UINT16_ARRAY(handles, stored_handles, count);

#if TEST_EXPLICIT_ORDERING
    const dsm_handle_t expected_handles[4] = {0, 1, 2, 3};
    TEST_ASSERT_EQUAL_UINT16_ARRAY(expected_handles, stored_handles, count);
#endif
}


void test_storage_ordering_appkeys(void)
{
    const struct
    {
        mesh_key_index_t key_id;
        uint8_t key[NRF_MESH_KEY_SIZE];
    } appkeys[4] = {
        {.key_id = 0, .key = {0}},
        {.key_id = 1, .key = {1}},
        {.key_id = 2, .key = {2}},
        {.key_id = 3, .key = {3}}
    };

    const struct
    {
        mesh_key_index_t key_id;
        uint8_t key[NRF_MESH_KEY_SIZE];
    } subnet = {0, {0}};
    nrf_mesh_keygen_network_secmat_ExpectAndReturn(subnet.key, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(subnet.key, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();
    flash_expect_subnet(subnet.key, subnet.key_id);
    dsm_handle_t subnet_handle;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_add(subnet.key_id, subnet.key, &subnet_handle));

    dsm_handle_t handles[4] = {DSM_HANDLE_INVALID};
    for (uint32_t i = 0; i < 4; ++i)
    {
        nrf_mesh_keygen_aid_ExpectAndReturn(appkeys[i].key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_aid_IgnoreArg_p_aid();
        flash_expect_appkey(appkeys[i].key, appkeys[i].key_id, subnet_handle);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_appkey_add(appkeys[i].key_id, subnet_handle, appkeys[i].key, &handles[i]));
    }
    dsm_handle_t stored_handles[4] = {DSM_HANDLE_INVALID};
    uint32_t count = 4;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_appkey_get_all(0, stored_handles, &count));
    TEST_ASSERT_EQUAL(4, count);
    TEST_ASSERT_EQUAL_UINT16_ARRAY(handles, stored_handles, count);

#if TEST_EXPLICIT_ORDERING
    const dsm_handle_t expected_handles[4] = {0, 1, 2, 3};
    TEST_ASSERT_EQUAL_UINT16_ARRAY(expected_handles, stored_handles, count);
#endif
}

void test_walking_through_uuid(void)
{
    uint16_t virtual_address = VIRTUAL_ADDR;
    dsm_handle_t address_handle[VIRTUAL_ADDRESS_COUNT];
    uint8_t virtual_uuid[VIRTUAL_ADDRESS_COUNT][NRF_MESH_UUID_SIZE] =
    {
        {0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0d, 0x0e, 0x0f},
        {0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18, 0x19, 0x1a, 0x1b, 0x1c, 0x1d, 0x1e, 0x1f},
        {0x20, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28, 0x29, 0x2a, 0x2b, 0x2c, 0x2d, 0x2e, 0x2f}
    };

    for (uint8_t iter = 0; iter < VIRTUAL_ADDRESS_COUNT; iter++)
    {
        nrf_mesh_keygen_virtual_address_ExpectAndReturn(&virtual_uuid[iter][0], NULL, NRF_SUCCESS);
        nrf_mesh_keygen_virtual_address_IgnoreArg_p_address();
        nrf_mesh_keygen_virtual_address_ReturnThruPtr_p_address(&virtual_address);
        flash_manager_entry_alloc_IgnoreAndReturn(NULL);
        flash_manager_mem_listener_register_Ignore();
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_virtual_add(&virtual_uuid[iter][0], &address_handle[iter]));
    }

    nrf_mesh_address_t addr =
    {
        .type = NRF_MESH_ADDRESS_TYPE_INVALID,
        .p_virtual_uuid = NULL
    };

    for (uint8_t iter = 0; iter < VIRTUAL_ADDRESS_COUNT; iter++)
    {
        TEST_ASSERT_TRUE(nrf_mesh_rx_address_get(virtual_address, &addr));
        TEST_ASSERT_EQUAL(NRF_MESH_ADDRESS_TYPE_VIRTUAL, addr.type);
        TEST_ASSERT_TRUE(memcmp(addr.p_virtual_uuid, &virtual_uuid[iter][0], NRF_MESH_UUID_SIZE) == 0);
    }

    TEST_ASSERT_FALSE(nrf_mesh_rx_address_get(virtual_address, &addr));
}

void test_invalid_address_lookup(void)
{
    const uint16_t raw_addresses[4] = {0x1234, 0x1237, 0x1643, 0x043f};
    dsm_handle_t handles[8] = {DSM_HANDLE_INVALID};

    for (uint32_t i = 0; i < 4; ++i)
    {
        flash_expect_addr_nonvirtual(raw_addresses[i]);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_publish_add(raw_addresses[i], &handles[i]));
    }

    for (uint32_t i = 0; i < 4; ++i)
    {
        flash_invalidate_expect(DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_ADDR_NONVIRTUAL, handles[i]));
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_publish_remove(handles[i]));
    }

    /* The address should be removed, thus a new flash operation is expected. */
    flash_expect_addr_nonvirtual(raw_addresses[1]);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_publish_add(raw_addresses[1], &handles[0]));

    /* This should just bump the alloc counter. */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_publish_add(raw_addresses[1], &handles[0]));

    dsm_handle_t stored_handles[1];
    uint32_t count = 1;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_get_all(stored_handles, &count));
    TEST_ASSERT_EQUAL(1, count);
    TEST_ASSERT_EQUAL_UINT16_ARRAY(handles, stored_handles, count);
#if TEST_EXPLICIT_ORDERING
    /* We use our superpowers to know that the virtual addresses start after the end of the non-virtuals. */
    const dsm_handle_t expected_handles[1] = {0};
    TEST_ASSERT_EQUAL_UINT16_ARRAY(expected_handles, stored_handles, 1);
#endif
}

